{
  "date": "2023-01-06T03:48:52.446Z",
  "title": "Celebrating NYE in NYC",
  "adventure": "{ \"slug\": \"new-years-eve-2022\", \"title\": \"New Years Eve 2022\" }",
  "description": "The first stop on our globe trot, NYE in NYC was a fantastic way to kick off the new year",
  "cover": "https://res.cloudinary.com/dfkk9455p/image/upload/v1672976542/NYE%20in%20NYC%20%2722/Street_Shot_merki6.png",
  "body": "# Arrival\n\nIt was my first time visiting New York City, and we were definitely thrown right into the most busy, lively version of it! We took the train from Newark airport to Penn Station and stepping out onto 8th street was jarring and exhilarating. There was a man on a trombone playing Christmas music, tourists like us shuttling large suitcases through the crowds, New Yorkers literally calling out to aggressive drivers, \"Hey, I'm walking here!\" It was a dream come true, New York City alive and bustling all in preparation for the New Year now just 36 hours away! We were extremely lucky to have our friends in town host us at their place in Hell's Kitchen, so Northbound we went.\n\nW﻿e fit right in with our *own* luggage to cart around, but thankfully our backpacks made for easily travels through the streets. Once we all got together it was an enormous relief to put those bags down and catch up. We ate loads of lovely snacks and got dinner at this great Italian restaurant called [Sicily](https://goo.gl/maps/zvuH2tqYpeRurReA6) just a few blocks from where we were staying in Hells Kitchen. W﻿ith full stomachs we set off for a rooftop bar to get an excellent view of the city and some boozy hot chocolates. The bar was absolutely packed with people and we spent a lot of time struggling to find a place to sit down, but once we did we made ourselves comfortable inside one of those plastic igloo domes and got cozy. The weather was absolutely incredible, but it was really nice to sit away from the crowds and have a quieter space to ourselves.\n\nO﻿n New Year's Day we decided to walk down towards Lower Manhattan on the [High Line trail](https://goo.gl/maps/FrYyEEnyrgqWQrLL7) and take in the throngs of people for the ball drop, as well as some incredible architecture and, what I would call, a fantastic display of urban reclamation. I really loved the High Line trail and found walking along those old rails with the trees and grasses growing to be really grounding in all the noise and energy of the city.\n\n![A view of Little Island on a cloudy foggy day from the High Line trail](https://res.cloudinary.com/dfkk9455p/image/upload/v1673810196/NYE%20in%20NYC%20%2722/NY_High_Line_oeacbe.png \"A foggy view of Little Island from the High Line trail\")\n\nOnce we got to the end of it we were in Greenwich Village and we took a moment to walk all those pretty cobblestone streets and oggle at the multi-million dollar houses (One house was listed for $12.5 million!). We got a little hungry, and thankfully we were near this great brunch spot called [Rosemary's](https://goo.gl/maps/fNn67yCmtJ9J1Rj67) so we decided to take a seat, rest our feet, and eat some focaccia, golden beets (the star of the meal), and have a drink.\n\nF﻿rom here we decided to split up and Gita and I wandered around Noho and Soho, stopping by Washington Square Park, NYU, and a great little matcha shop called [Matchaful](https://goo.gl/maps/pYs4hSRQowUQAbmp7) on Canal St. We then took the subway (my first time!) up to Hell's Kitchen and got ready for our New Years Eve festivities!\n\n![Crowds gathering in the streets near Times Square](https://res.cloudinary.com/dfkk9455p/image/upload/v1672976542/NYE%20in%20NYC%20%2722/Street_Shot_merki6.png \"Crowds of people began to gather hours in advance of the ball drop\")\n\nI﻿n the spirit of keeping things lower-key to avoid the crowds in and around Times Square, we decided to do an early dinner at a nice sushi restaurant called [Katsuya](https://goo.gl/maps/f72vTiL1Yq4i7DyK9) near the Hudson Yards. We shared a bottle of sparkling sake, which I didn't know was a thing, and talked about our resolutions and general plans for the new year and on. Afterwards we walked back towards our friends' apartment and stopped into a small bar called [Rudy's](https://goo.gl/maps/ZRMaqmMuMPMqgQYM9) where we were greeted by the largest, most definitely over the buildings legal capacity crowd I'd ever seen since pre-COVID! We took a shot of tequila each, tried to get some more drinks, saw the crowd at the bar, and decided we'd rather make our own cocktails at the apartment. So off we went! From there place we counted down the New Year, took some pictures, played some music, and had a really special night.\n\nT﻿he next morning we hit up [Hudson Bagel](https://goo.gl/maps/zx55UbPNk6rDAug79) and got some fantastic bagels and cream cheese, and then Gita and I made our way to Central Park for an urban \"hike.\" To get there we boldly ventured into Times Square to see what kind of chaos remained and it was really something awesome. Confetti from the night before was still blowing around the Square, getting picked up on breezes and dropped in places only to be lifted again moments later.\n\n![A photograph of the Times Square ball drop the next morning](https://res.cloudinary.com/dfkk9455p/image/upload/v1672976544/NYE%20in%20NYC%20%2722/Times_Square_Facing_South_n7opmh.png \"Confetti was still in the air and the ball could still be seen amid all the usual chaos\")\n\nO﻿nce we had our fill of the beating heart of the city we made our way to 30 Rockefeller for some classic sight-seeing. We stopped by the Radio City Music Hall (took some pictures), the 30 Rock building and ice rink (took some more pictures), and St. Patrick's Cathedral (didn't take any pictures, didn't feel appropriate I suppose). All the way Gita and I talked about the city, what we thought about it, the crowds, the architecture. I really loved seeing so many people and hearing so many languages. There's something really special about the city that never sleeps, and definitely very exciting. I can see why everyone comes here! Still though, I was very eager for some nature and a little room away from the throngs of New Yorkers and tourists alike.\n\nOnce in Central Park, all the crowds and chaos dropped away. We ended up walking the full length of the park into Harlem and it was amazing! It's shocking to me how much peace and quiet can be had when right on either end of you to the East or West is a﻿ll the traffic and honking and bustling of crowds. The park itself was pretty full of people, but since it truly is just so large it was hardly a detractor from the gorgeous sunlight and breeze we got. We really were lucky with the weather- we were so concerned with bringing warm layers and needing to mail things back to keep our backpacks light for our long travels but we ended up being nice and warm in what was effectively a false spring.\n\n![A photogragh of Lower Manhattan from the North end of the Jacqueline Kennedy Onassis Reservoir](https://res.cloudinary.com/dfkk9455p/image/upload/v1672976261/NYE%20in%20NYC%20%2722/Central_Park_Aquifer_zndgz4.png \"Central Park was absolutely stunning\")\n\nO﻿nce we got to Harlem we set out to see Columbia's main campus which was absolutely stunning in the sunset, and then we made our way up to their medical campus in the Heights via the subway (ride #2!). We poked our heads into a few buildings, asked for and were denied access to see the inside of the main lecture hall Gita might end up studying in, checked out the apartments nearby since you never know, and made our way back down to Hell's Kitchen for some truly great Thai food at Zoob Zib on 9th Avenue.\n\n![Columbia's Low Memorial Library on the main campus](https://res.cloudinary.com/dfkk9455p/image/upload/v1672976545/NYE%20in%20NYC%20%2722/Columbia_Library_gxbp78.png \"Columbia's main campus was serene and scholarly, just as expected!\")\n\nT﻿he next morning we took a much slower day and walked our way down south. We first walked along Broadway, then snaked through to the Hudson and walked a few blocks more before we slipped back into the crowds on the main streets. Our friends met up with us there and together we wandered through The Strand picking out books and postcards and getting some shockingly good, entirely unbranded sodas from the store's cafe. I definitely would've loved to spend more time there but dinner was calling and we still hadn't been to Chinatown, so off we went. We decided to eat at Deluxe Green Bo to try out an eggplant dish our friends recommended, and it was fantastic! The food was great and so were the prices, and afterwards we strolled through Little Italy together enjoying our final night in the city.\n\n![A view of Chinatown in the early evening](https://res.cloudinary.com/dfkk9455p/image/upload/v1672976543/NYE%20in%20NYC%20%2722/Chinatown_jviara.png \"I was really charmed by these lanterns in Chinatown\")\n\nWe rode the subway (the third and final ride!) back to Hell's Kitchen, grabbed some monstrous cookie sandwiches from Schmackary's on 45th and watched a few episodes of White Lotus together to finish off the evening. With one last round of hugs, we shouldered our bags and made our way to Penn Station for the train to Newark. Let the travels begin!"
}