{
  "date": "2023-01-06T03:48:52.446Z",
  "title": "Celebrating NYE in NYC",
  "adventure": "{ \"slug\": \"new-years-eve-2022\", \"title\": \"New Years Eve 2022\" }",
  "description": "The first stop on our globe trot, NYE in NYC was a fantastic way to kick off the new year",
  "cover": "https://res.cloudinary.com/dfkk9455p/image/upload/v1672976542/NYE%20in%20NYC%20%2722/Street_Shot_merki6.png",
  "body": "# Arrival\n\nIt was my first time visiting New York City, and we were definitely thrown right into the most busy, lively version of it! We took the train from Newark airport to Penn Station, and stepping out onto 8th street was so jarring and exhilarating. There was a man on a trombone playing Christmas music, tourists like us shuttling large suitcases through the crowds, New Yorkers literally calling out to aggressive drivers, \"Hey, I'm walking here!\" It was a dream come true, New York City alive and bustling all in preparation for the ball drop just 36 hours away!\n\nW﻿e had our own luggage to lug around to our friends apartment, but thankfully our backpacks made for easily travels through the streets. Once we all got together it was an enormous relief to put those bags down and catch up. We ate loads of lovely snacks, and got dinner at this great Italian restaurant called [Sicily](https://goo.gl/maps/zvuH2tqYpeRurReA6) just a few blocks from where we were staying in Hells Kitchen.\n\nW﻿ith full stomachs we set off for a rooftop bar to get an excellent view of the city and some boozy hot chocolates. The bar was absolutely packed with people and we spent a lot of time struggling to find seats, but once we did we made ourselves comfortable inside one of those plastic igloo domes and got cozy. We really would have preferred to sit outside since the weather was absolutely incredible, but it was really nice to sit away from the crowds and have a quieter space to ourselves.\n\nO﻿n New Years Day we decided to walk down towards Lower Manhattan on the High Line trail and take in the throngs of people for the ball drop, as well as some incredible architecture and, what I would call, a fantastic display of urban reclamation. I really loved the High Line trail and found walking along those old rails with the trees and grasses growing to be really grounding in all the noise and energy of the city, at least as much as it could be while literal hundreds of people push past you while walking the trail. Once we got to the end of it we were in Greenwich Village and we took a moment to walk all those pretty cobblestone streets and oggle at the multi-million dollar houses (One house was listed for $12.5 million!). We got a little hungry, and thankfully we were near this great brunch spot called Rosemary's so we decided to take a seat, rest our feet, and eat some focaccia, golden beets (the star of the meal), and have a drink.\n\nF﻿rom here we decided to split up (I grabbed a veggie burger from a bodega nearby which was honestly an amazing decision) and Gita and I wandered around Noho and Soho, stopping by Washington Square Park, NYU, and a great little matcha shop called Matchaful on Canal St. We then took the subway (my first time!) up to Hell's Kitchen and got ready for our New Years Eve festivities!\n\nI﻿n the spirit of keeping things lower-key to avoid the enormous crowds in and around Times Square, we decided to do an early dinner at a nice sushi restaurant called Katsuya near the Hudson Yards. We shared a bottle of sparkling sake, which I didn't know was a thing, and talked about our resolution plans and and general plans for the new year and on. Afterwards we walked back towards our friends apartment and stopped into a small bar called Rudy's where we were greeted by the largest most definitely over the buildings legal capacity crowd I'd ever seen in a bar since being a student at UIUC.\n\nT﻿he next morning we hit up Hudson Bagels and got some fantastic bagels and cream cheese, and then Gita and I went off on a Central Park \"hike.\" We ended up walking the full length of the park into Harlem and it was amazing! It's crazy to me that just stepping into the park brings so much peace and quiet."
}