{
  "date": "2022-09-30T19:00:07.382Z",
  "adventure": "{ \"slug\": \"exploring-the-pacific-northwest\", \"title\": \"Exploring the Pacific Northwest\" }",
  "title": "Hiking Mt. St. Helens",
  "description": "On a perfectly sunny and clear sky day, we hiked to the summit of the active volcano Mt. St. Helens in Washington.",
  "album": "https://photos.app.goo.gl/GPb1cvXNtvmnE9oz6",
  "cover": "https://res.cloudinary.com/dfkk9455p/image/upload/v1664772696/Mt.%20St.%20Helens%2009-22/IMG_3400-rotated_ufuvzt.jpg",
  "body": "So we'd decided to climb Mt. St. Helens.\n\nW﻿ell, climb isn't exactly fair. Since the volcano erupted in 1980 there hasn't really been much \"climbing\" to be had to the summit of the mountain, more like a fairly strenuous hike. So, really, we had decided to hike to the top of Mt. St. Helens. In order to pull off such a feat you really don't need much, just a permit, some water, and a good pair of shoes. We got all our gear together Thursday evening, turned off our Outlook and Teams notifications, and drove off into the Washington wilderness.\n\n# \"﻿Base Camp\"\n\nW﻿e decided to set up camp at the Climber's Bivouac Trailhead. This very popular starting point for those wishing to summit Mt. St. Helens had ample space for anyone wanting to car camp as well as a handful of great tent camping sites. Unfortunately, no water was at the campsite, but we planned ahead and brought about a gallon or so (which spilled all over the back of the car where I decided to leave it unsecured despite Gita's suggestions to do otherwise) which kept us plenty hydrated. T﻿he actual camping itself was nothing to write about except that we were regularly woken up to the lights and sounds of people coming and going from the campsite.\n\n# T﻿he Ascent\n\nR﻿ight at the trailhead we were unpleasantly informed that the forest service does not allow any waste to be left behind. ***Any***. Thankfully, [GO Anywhere bags](https://www.rei.com/product/692303/cleanwaste-go-anywhere-toilet-kit-waste-bag) are provided free of charge for you to grab, but relieving yourself into a bag really kills the mountain climbing vibes, to be sure. Anyway, past the free goodies was a permitting station so the forest service can keep track of climbers, and then off and away is the trail!\n\nT﻿he beginning of the climb was easy, straightforward, and dare I say a little boring if you're used to PNW hikes. We started around 7ish when it was a little chilly in the air and once we made our way to the boulder fields"
}