{
  "date": "2021-01-16T11:23:15.712Z",
  "title": "Hua Hin Orientation",
  "adventure": "{ \"slug\": \"thailand-teaching-science-and-english\", \"title\": \"Thailand: Teaching Science and English\" }",
  "description": "We spent a little over a week in Hua Hin for our XploreAsia orientation getting acclimated to our new home.",
  "album": "https://photos.app.goo.gl/zuFtphYeLpYn1Az67",
  "cover": "https://res.cloudinary.com/dfkk9455p/image/upload/v1610796595/PXL_20201218_074618898_hygg4o.jpg",
  "body": "# Beach Bound\n\nOur final morning in quarantine was one of a lot of emotions. It felt strange to leave behind the room I had lived in for 15 days for the exciting unknown of a country whose borders I had past over two weeks ago and yet seen none of! Gita and I both excitedly boarded our shuttle bus and marveled at how good something simple as sitting in a new place could feel. Our first stop was to pick up a fellow ex-quarantiner and future English teacher, [Nicole Kuphal](https://www.facebook.com/nicole.kuphal.94), who, just like us, was feeling excited to leave her hotel!\n\n![Gita, Nicole, and myself (Isaac) taking a picture together inside our shuttle to Hua Hin.](https://res.cloudinary.com/dfkk9455p/image/upload/v1610796944/PXL_20201217_020217106_zbm4gf.jpg \"Three English teachers, free at last.\")\n\nThe journey to Hua Hin was fast and once we arrived we were pleasantly surprised by [the accommodation](https://goo.gl/maps/iTjFhivkurki8fPR8) prepared for all the new teachers. We messaged our coordinators that we were at the hotel, and we received the good news that we had the day off to explore and enjoy ourselves. Naturally, the first thing we did was go straight for the water to dip our toes into the warm Gulf of Thailand. Afterwards, we scouted out a place to get something to eat. Naturally, not speaking Thai was a bit of a hurdle to pass but we found a cute restaurant after a little wandering around that served up some good Thai classics. We rounded out the rest of the day with a little beach time and met up with some of the more senior teachers (those who had been at the orientation for a few more days than us- the program brings teachers in a rolling fashion with new teachers arriving as soon as their quarantines are up) for dinner at a very Western friendly restaurant [Coco51](https://goo.gl/maps/rFLTcwrbQjQiZfsZ7).\n\n# Day 1 - Pups and Prayers\n\n# Day 1 - Pups and Prayers\n\nOn this official start to our orientation we were sent off to visit a temple Wat Khao Tao for an introduction to Buddhism from a very welcoming and friendly monk, as well as for some playtime with cats and dogs at a local non-profit animal rescue (founded in part by the organization we were with), Rescue Paws. The temple was very peaceful and beautiful, and the guided meditation provided by the monk was much needed and appreciated. We also learned a little bit about the monks' lifestyles, such as how they obtain their food from the day by taking a bowl with them out in to the community each morning and accepting whatever is placed in to their bowl as their one meal per day. Imagine getting something strong tasting like curry mixed with something sweet and entirely different, like cake! Thankfully, it seems most people are cognizant of this and try to provide food in separate plastic bags or of a neutral taste.\n\nAfter we learned of the Thai monk life and played with some little rascals at the animal shelter, we returned for a welcome dinner host by the XploreAsia team where we said our goodbyes to some of the more senior teachers who were departing for their placement"
}