{
  "date": "2020-12-16T16:38:12.977Z",
  "title": "Quarantine Blues",
  "adventure": "{ \"slug\": \"thailand-teaching-science-and-english\", \"title\": \"Thailand: Teaching Science and English\" }",
  "description": "After traveling for two days, Gita and I spend two weeks cooped up in our separate hotel rooms at the Rembrandt Hotel and Suites in Bangkok",
  "body": "To anyone out there that thinks spending 15 days confined to your hotel room doesn't sound too bad, let me stop you right there. It isn't the size of the room, or the amenities, or even the food that really breaks you. It's the not being outside, the not seeing the faces of other humans being in person, the not being able to just wander around and gaze at new things. I honestly feel extremely grateful that we had internet because in any previous time this would have been mind-numbingly dull to go through. Thankfully, that was not the case! We had the whole wide web at our fingertips filled with every kind of media and content one could ask for, not to mention the amazing advances of being able to video or audio call friends and family [over](https://discord.com/) [a](https://web.whatsapp.com/) [myriad](https://zoom.us/) [of](http://line.me/) [services](https://messenger.com/), enabling all sorts of social comforts like [playing board games](https://store.steampowered.com/app/286160/Tabletop_Simulator/), watching [Netflix](https://www.netflixparty.com/), or just hanging out to chill and chat.\n\n<div class=\"captioned-image\"><img src=\"https://res.cloudinary.com/dfkk9455p/image/upload/v1608139356/Messy_Desk_at_the_Rembrandt_uxkvdr.jpg\" alt=\"Isaac's laptop, portfolio of important documents, journal, and various other items on a messy, disorganized desk\" title=\"A messy desk in just a few days\" /><div class=\"image-caption\">With so much time on my hands, I decided to dig in and become actively engaged in so many things!</div></div>\n\nAt the same time, however, not enough wonderful things can be said about talking a stroll down the block, or just standing in your backyard and feeling the breeze on your face and smelling that fresh air that didn't come from the same air conditioning unit in that one room you sleep, eat, workout, and veg-out in.\n\n<div class=\"video-container\">\n      <iframe src=\"https://www.youtube.com/embed/zzlIq1X6vA8\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n    </div>\n\nThankfully, my multi-purpose room was more than enough space for me to do all of those things, and the food from the Rembrandt's various restaurants really helped keep both Gita and myself in high spirits. It was always a fun game to order our meals a few days in advance, selecting from all the various options of different cuisines and getting it delivered right to your door, hassle-free!\n\n<div class=\"captioned-image\"><img src=\"https://res.cloudinary.com/dfkk9455p/image/upload/v1608139339/Enchiladas_tqrpki.jpg\" alt=\"Enchiladas for lunch in a collection of serving contains in front of Isaac's laptop\" title=\"A gourmet meal fit for a COVID prisoner\" /><div class=\"image-caption\">Enchiladas! In Bangkok! Delivered to my hotel room door!</div></div>\n\nFood also served as a critical breaker-of-monotony in our days as the little chime of the doorbell to our rooms would indicate that time was, in fact, still passing, and Gita and I often used our meal times as a chance to video chat one another (albeit with inconsistent success on several of the aforementioned platforms \\[Zoom was the most reliable, in case anyone was wondering!]) and catch up on the exciting updates we had for one another about our long and varied days. Or, we'd watch a movie and just relish the presence of another person in the room.\n\n<div class=\"captioned-image\"><img src=\"https://res.cloudinary.com/dfkk9455p/image/upload/v1608139342/Bird_Company_e1hcej.jpg\" alt=\"A pigeon sits outside Isaac's hotel room window\" title=\"Brave pigeon watches man\" /><div class=\"image-caption\">I also had the lovely company of an army of pigeon's, insistent on slamming in to my window all hours of the day. Honestly loved these little guys, always gave me a good laugh!</div></div>\n\nAfter 5 days of waking up, working out and stretching, eating, sitting, eating, sitting, eating, and then calling it a night, we finally got our first COVID test. We were each summoned individually down to the loading-dock area where we were originally brought in to the hotel from and tested twice, once with a check swab and then with a nasal swab. A very thorough nasal swab. Tissues in hand, we dabbed our eyes and blew our sore noses and waited the 24 hours that it would take for them to call us with the predictable (yet still exceedingly well received) news that we were, in fact, COVID-negative! Hurray! This now allowed us to begin the ***most critical*** stage of our entire experience here, ***outside time!***\n\n<div class=\"captioned-image\"><img src=\"https://res.cloudinary.com/dfkk9455p/image/upload/v1608139353/Gita_Waving_Outside_at_Rembrandt_p5h19r.jpg\" alt=\"Gita waving while standing on the pool deck of the Rembrandt hotel\" title=\"Gita waves\" /><div class=\"image-caption\">This was the first time Gita and I saw each other in person for almost 7 days! I enjoyed the outside time more for getting to see her than anything else.</div></div>\n\nAs a rule, the Thai Ministry of Health requires all incoming persons to the nation of Thailand to undergo some sort of quarantine upon arrival. For non-Thai nationals, it must be within a hotel called an ASQ, or **A**lternate **S**tay **Q**uarantine. For all intents and purposes, these ASQ's are just hotels that have been repurposed with higher cleaning standards and modified staffing to meet the unusual circumstances their residents find themselves in. One of the finer details of the Ministry of Health's mandates is that guests at ASQ's are not allowed to go outside (or have an open window or balcony access) until they have tested negative for the first of the two COVID tests they are required to take. In our case, that test fell on the 5th day (which we learned was around the same time as other teachers arriving to Thailand), and on the 7th we were officially allowed out to the pool deck on the 4th floor of the hotel every day at 4:00pm (we chose the time)! It was a sweet, sweet taste of freedom, albeit a premature one, as we still had ***10 more days to go***.\n\n<div class=\"captioned-image\"><img src=\"https://res.cloudinary.com/dfkk9455p/image/upload/v1608139325/Waiting_to_Go_Outside_Meme_izxxzc.jpg\" alt=\"A meme depicting Isaac standing by the door to his hotel room, waiting to be retrieved at 4:00pm with the caption \"Me at 3:59pm like:\"\" title=\"A quality meme I devised\" /><div class=\"image-caption\">It took me a lot longer to take this photograph than I'm proud to admit, but what a quality meme!</div></div>\n\nFrom that point onward, each day started to blur in to the next, with the monotony only broken up for various family board game nights (mornings, in my case!), a little DnD, impromptu hangout sessions with friends on the opposite end of the world, movie nights, and pet coding projects (such as this site, and [another site curating letters from my grandfather to his mother](https://carrolls-letters.isaachsmith.info/)).\n\n<div class=\"captioned-image\"><img src=\"https://res.cloudinary.com/dfkk9455p/image/upload/v1608139343/Rembrandt_Pool_Deck_uivoel.jpg\" alt=\"The Rembrandt hotel pool deck with several pool reclining chairs sectioned off 6 feet from one another and divided by tall plants for privacy\" title=\"A little patch of outside\" /><div class=\"image-caption\">The pool deck, while not enormous, was perfect for getting some fresh air above the city's streets. We were each confined to one chair, selected by us upon walking out each day, and were instructed to stay put until summoned back in 45 minutes later.</div></div>\n\nA second COVID test was administered on the 12th day and was ***equally*** thorough, and both Gita and myself walked away with the anticipated yet, again, still well received news that were still negative. We received the news of our good health just yesterday, the 15th of December, and I write this now on the 16th (technically the 17th, as it's just past midnight!), our last night before we depart at 8:00 in the morning for our next stop, [Hua Hin](https://goo.gl/maps/r8R3wummJsiCA36G6)! There we will be introduced to the various members of [XploreAsia](https://www.xploreasia.org/) who have helped us all along the way in getting to Thailand and finding employment, and we will volunteer for their organization [Rescue Paws](https://rescuepawsthailand.org/), get a bank account, phone numbers, a cooking lesson, cultural lessons, and other exciting excursions and activities!\n\nThere will be loads more exciting things to report coming up very shortly, so stay tuned and stay safe!",
  "album": "https://photos.google.com/album/AF1QipMchyHB4OVZZhPxbUfJ1qTShNAcNgRlZD8grX1f",
  "cover": "https://res.cloudinary.com/dfkk9455p/image/upload/v1607410604/Rembrandt_Hotel_Room_yb964d.jpg"
}