{
  "date": "2020-11-27T17:19:09.647Z",
  "title": "The Adventure Begins",
  "adventure": "{ \"slug\": \"thailand-teaching-science-and-english\", \"title\": \"Thailand: Teaching Science and English\" }",
  "description": "From O'Hare to Bangkok, traveling the world is a long process! In COVID times, that process sure is messy too.",
  "body": "# Before We Go...\n\nBefore we even left for Thailand, Gita and I had a lot of our work cut out for us. To begin the process we first signed up for a TEFL course through the company [MyTEFL](https://mytefl.com/). We purchased the extra \"internship\" package hoping that we would be able to get job placements in Thailand or Vietnam through their partner agency, [XploreAsia](https://www.xploreasia.org/). A few weeks in to taking the coursework and emailing documents to our coordinator with MyTEFL it became clear to Gita and I that the global COVID-19 pandemic was not going to end any time soon and our hope began to waver. Days went by without any sort of clear communication from MyTEFL and the bad news kept rolling in in the form of grim headlines and disheartening presidential debates when, like a miracle, on July 20th we get an email scheduling a meeting with our coordinator in XploreAsia to hash out the specifics and get us on our way to Thailand! Our target date, as of that initial meeting, appeared to be the end of August, assuming all went well, which worked perfectly with the end of our lease in Logan Square. Unfortunately, as some of you reading this already know, that end of August date was overshot by two months due to COVID induced delays and added logistical complications seeing as all visa application work had to be done by mail and ahead of our arrival in Thailand (the program typically has a different process in normal, global heath circumstances, so this was new territory for everyone). After several months of planning, coordinating, mailing, scheduling, and desperately crossing our fingers, that fantastic, lovely email arrived granting bestowing upon the two of us all the documents we needed to apply for our Thai visas. \n\nWith visa documents in hand the countdown clock to Thailand had officially begun. What was up until that point a fantasy based on shaky grounds due to the global situation had suddenly become a very real, tangible future for the both of us. We religiously filled out our forms, signed our applications, dotted our I's and crossed our T's, and mailed them off, holding our collective breath. Not more than 3 days later \n\n\n\nand a job placement at [Prachuap Wittayalai school](https://goo.gl/maps/JUHn7XYjHJGRJieU9) in [Prachuapkirikhan](https://goo.gl/maps/fPbaVkGkv6khbW959). \n\n<div class=\"captioned-image\"><img src=\"https://res.cloudinary.com/dfkk9455p/image/upload/v1607420175/Packing_Chaos_ntxi3k.jpg\" alt=\"Packing chaos in the attic\" title=\"Packing Chaos\" /><div class=\"image-caption\">My parents were very generous to let us completely take over their attic for our explosive packing needs!</div></div>\n\n\n\n# First Stop, ORD\n\n# Bangkok Bound",
  "cover": "https://res.cloudinary.com/dfkk9455p/image/upload/v1607410603/O_Hare_ysr4dk.jpg",
  "album": "https://photos.app.goo.gl/FVw9LWSQyYeY52vR7"
}