{
  "date": "2020-11-27T17:19:09.647Z",
  "title": "The Adventure Begins",
  "adventure": "{ \"slug\": \"thailand-teaching-science-and-english\", \"title\": \"Thailand: Teaching Science and English\" }",
  "description": "From O'Hare to Bangkok, traveling the world is a long process! In COVID times, that process sure is messy too.",
  "body": "# Before We Go...\n\nBefore we even left for Thailand, Gita and I had a lot of our work cut out for us. To begin the process we first signed up for a TEFL course through the company [MyTEFL](https://mytefl.com/). We purchased the extra \"internship\" package hoping that we would be able to get job placements in Thailand or Vietnam through their partner agency, [XploreAsia](https://www.xploreasia.org/). A few weeks in to taking the coursework and emailing documents to our coordinator with MyTEFL it became clear to Gita and I that the global COVID-19 pandemic was not going to end any time soon and our hope began to waver. Days went by without any sort of clear communication from MyTEFL and the bad news kept rolling in in the form of grim headlines and disheartening presidential debates when, like a miracle, on July 20th we get an email scheduling a meeting with our coordinator in XploreAsia to hash out the specifics and get us on our way to Thailand! Our target date, as of that initial meeting, appeared to be the end of August, assuming all went well, which worked perfectly with the end of our lease in Logan Square. Unfortunately, as some of you reading this already know, that end of August date was overshot by two months due to COVID induced delays and added logistical complications seeing as all visa application work had to be done by mail and ahead of our arrival in Thailand (the program typically has a different process in normal, global heath circumstances, so this was new territory for everyone). After several months of planning, coordinating, mailing, scheduling, and desperately crossing our fingers, that fantastic, lovely email arrived bestowing upon the two of us all the documents we needed to apply for our Thai visas.\n\nWith visa documents in hand the countdown clock to Thailand had officially begun. What was up until that point a fantasy based on shaky grounds due to the global situation had suddenly become a very real, tangible future for the both of us. We religiously filled out our forms, signed our applications, dotted our I's and crossed our T's, and mailed them off, holding our collective breath. 21 endless days later, and finally had our visas, COEs (Certificate of Entry), and a job waiting for us at [Prachuap Wittayalai school](https://goo.gl/maps/JUHn7XYjHJGRJieU9) in [Prachuapkirikhan](https://goo.gl/maps/fPbaVkGkv6khbW959). \n\n# First Stop, ORD\n\nWith all documents from Thailand assembled, degrees legalized, and hopes thoroughly improved, we had only three final steps to take before we got to Thailand:\n\n1. Get a Fit-To-Fly certificate indicating we are of good health\n2. Obtain a COVID-19 within 72 hours of the flight showing we are COVID-negative\n3. Get on that damn plane\n\nObviously, that third step goes without saying, but boy did it feel like a step of its own. \n\nObtaining the COVID test was a breeze, the [Midwest Express Clinic in Willowbrook](https://midwestexpressclinic.com/locations/willowbrook-il/) was able to get us in for an appointment on Thanksgiving morning with no questions asked. We were extremely pleased with how professional, flexible, and, most importantly, quick they were. Our Fit-To-Fly certificate needed to be done at another facility (the one in [Wicker Park](https://midwestexpressclinic.com/locations/bucktown-wicker-park-chicago-il-urgent-care/)) and thankfully we could get a walk-in appointment that Saturday without any trouble. In less than an hour we walked out with our certificate, and the following day our COVID test results came back to us, negative, completing all the final documents we needed! All that was left was for us to pack and print the 160 pieces of paper (that's the real number!) that made up all the documents we would need to travel.\n\n<div class=\"captioned-image\"><img src=\"https://res.cloudinary.com/dfkk9455p/image/upload/v1607420175/Packing_Chaos_ntxi3k.jpg\" alt=\"A mess of clothes and other items with open suitcases in my parent's attic\" title=\"Packing chaos in my parent's attic\" /><div class=\"image-caption\">My parents were extremely kind to lend us their attic for our packing chaos, which we made ample use of!</div></div>\n\nThe final 48-ish hours were a whirlwind of activity involving a flurry of packing and goodbyes, but finally on November 30th we made our way to the airport with Gita's parents (who kindly took our car back to their garage!), said our goodbyes, and stepped into Terminal 5.\n\n<div class=\"captioned-image\"><img src=\"https://res.cloudinary.com/dfkk9455p/image/upload/v1607410549/O_Hare_Selfie_kfimdl.jpg\" alt=\"A quick selfie of Gita and myself in Terminal 5 with a nearly empty terminal in the background\" title=\"A selfie with no one around\" /><div class=\"image-caption\">A quiet and festive Terminal 5.</div></div>\n\nIt was eerily quiet. Given the current travel situation in the states it was understandable, and I even anticipated it, but I was still taken aback by just how empty and silent the place was. Gita and I made our way to the Qatar Airways desk where we saw a sign informing us that our flight was ***the only flight*** of the day, and that the desk would close promptly at one hour prior to take-off. We were there several hours in advance, but we were still surprised to learn that our flight was the only one! Shortly after we got in line it became clear that almost everyone around us must be getting on that same flight as all the other check-in desks for other airlines were near empty and unstaffed.\n\n<div class=\"captioned-image\"><img src=\"https://res.cloudinary.com/dfkk9455p/image/upload/v1607410603/O_Hare_ysr4dk.jpg\" alt=\"A nearly empty Terminal 5 at O'Hare on November 30th\" title=\"Hardly anyone around us in the Qatar Airways check-in line at Terminal 5\" /><div class=\"image-caption\">It was eerily empty for a post-Thanksgiving Monday at Terminal 5.</div></div>\n\nAfter presenting our Fit-To-Fly certificate, COVID test results, passport with visa, quarantine hotel accommodations (ASQ), and insurance indicating COVID-19 coverage up to $100,000, we were approved, our luggage taken away, and boarding tickets put in hand. Now, typically, security is my least favorite part of getting on a plane, as I'm sure it is everyone else's. This time, however, was easily the smoothest, best experience I had ever had seeing as there was literally no one else in line. With no one in front, and no one behind, I just took my time! All the security TSA staff seemed to be very relaxed and at ease, no one was harsh or overly tense about getting a horde of people through to their gates in time, just a nice comfortable pace to take my shoes off, thank you. What I would give to have it always be like that I swear. Once through security, we only had to go a few yards before we were right at our gate with practically everyone else who was headed out to Qatar, and there we settled in for the hour or so until departure.\n\n<div class=\"captioned-image\"><img src=\"https://res.cloudinary.com/dfkk9455p/image/upload/v1607410573/O_Hare_Airplane_nhposk.jpg\" alt=\"A selfie of Gita and myself aboard our flight to Qatar sporting face masks and face shields provided by Qatar Airways\" title=\"Suited up and ready to fly\" /><div class=\"image-caption\">Adorned with face mask and shield, we were ready to fly (albeit nervously!).</div></div>\n\n  \n\n# Bangkok Bound",
  "cover": "https://res.cloudinary.com/dfkk9455p/image/upload/v1607410603/O_Hare_ysr4dk.jpg",
  "album": "https://photos.app.goo.gl/FVw9LWSQyYeY52vR7"
}